{
  "summaries": [
    "Full Stack Developer with expertise in React, Flutter, and backend architecture on Google Cloud and AWS. Skilled in building scalable web and mobile applications with a strong focus on UI/UX, and seamless front-end and back-end integration for a smooth user experience.",
    "Full Stack Developer specializing in backend architecture and LLM applications. Built RESTful APIs with AWS Lambda and GCS Cloud Run. Designed prompts to optimize LLMs for chatbots and utility processors. Experienced in React and Flutter for seamless frontend integration.",
    "Game Developer with expertise in Unity 2D/3D, Blender modeling, and multi-engine development. Specializes in gamified UI/UX design, fast prototyping, and scalable architecture. Experienced in mobile game development and integrating game engines with traditional mobile app frameworks.",
    "Game Developer specializing in technical design, scalable architecture, and multi-engine development. Experienced in Unity 2D/3D, Blender modeling, and building structured, maintainable game systems. Skilled in fast prototyping and designing frameworks that support long-term scalability and adaptability."
  ],
  "titleOptions": [
    "Full Stack Developer",
    "Software Engineer",
    "Cloud Computing Engineer",
    "UI & UX Designer",
    "Language Model Engineer",
    "Game Developer",
    "Flutter Developer",
    "Artist"
  ],
  "skills": [
    {
      "category": "Programming Languages",
      "items": [
        "JavaScript",
        "TypeScript",
        "Python",
        "C & C++",
        "C#",
        "Dart",
        "SQL"
      ]
    },
    {
      "category": "Frameworks & Libraries",
      "items": [
        "Flutter",
        "React.js",
        "Unity",
        "Node.js",
        "Express",
        "Unity Engine"
      ]
    },
    {
      "category": "Cloud & DevOps",
      "items": [
        "Google Cloud (Cloud Run, App Engine)",
        "AWS (Lambda, S3)",
        "Firebase",
        "Docker",
        "CI/CD (e.g., GitHub Actions, Jenkins)"
      ]
    },
    {
      "category": "Databases & Data Management",
      "items": [
        "Firestore",
        "SQL (MySQL, PostgreSQL)",
        "NoSQL (MongoDB)",
        "Vector Databases",
        "Cloud Storage (e.g., AWS S3, GCS)"
      ]
    },
    {
      "category": "LLM & AI",
      "items": [
        "Prompt Engineering",
        "Restful API Creation",
        "Response Post-processing",
        "Vector Store",
        "Fine-tuning",
        "ML Model Integration"
      ]
    },
    {
      "category": "UI/UX & Design Tools",
      "items": [
        "Adobe Illustrator",
        "Figma",
        "Paper & Digital Drawing",
        "Blender (3D Modeling)",
        "Shader Development"
      ]
    },
    {
      "category": "Game Development & Prototyping",
      "items": [
        "Unity (2D & 3D)",
        "Blender",
        "Unreal",
        "Godot",
        "C, C++, and C#",
        "Asset Optimization",
        "Rapid Prototyping",
        "Shader Graph / Custom Shaders"
      ]
    },
    {
      "category": "General & Tools",
      "items": [
        "Git",
        "Linux CLI",
        "Agile / Scrum",
        "Testing & Debugging",
        "REST & GraphQL APIs"
      ]
    }
  ],
  "experiences": [
    {
      "title": "Let’s Be Critic",
      "subtitle": "A complaint and advisory chatbot",
      "description": "Solo Full-Stack Developer",
      "date": "",
      "details": [
        "Developed an LLM-driven search trigger to analyze user input and historical data prior to vector queries, reducing unnecessary searches by 70% with minimal overhead.",
        "Architected a Firestore-based tracking and scheduling system that automates keypoint storage in a vector store, enabling Cloud Run deployment and eliminating the need for a dedicated server.",
        "Created an asynchronous dual-LLM workflow, separating chat handling from keypoint summarization and storage, reducing token usage by up to 80% thanks to a shorter required context.",
        "Built an automated review generator powered by user complaint logs, boosting user engagement.",
        "Optimized prompt engineering and response handling to support seamless topic or product switching within a single chat session, enhancing the user experience."
      ]
    },
    {
      "title": "Hero’s Clock",
      "subtitle": "A light-weight cross-platform productivity app",
      "description": "Solo Flutter Developer",
      "date": "",
      "details": [
        "Designed and implemented the app’s workflow and visuals, created seven custom image assets, and built two task-saving methods—SharedPreferences for current tasks and SQLite for favorites. Conducted two user tests leading to a major UI overhaul that split features across three screens.",
        "Crafted a responsive UI and app-flow for both mobile and web, employing a screen utility system to maintain consistent layouts across various devices.",
        "Introduced a page-view UI and a 'cached last page' mechanic, cutting user interaction steps from three to one for single-task-timer features."
      ]
    },
    {
      "title": "Cardio Traveler",
      "subtitle": "A mobile fitness serious game",
      "description": "Lead Programmer, Designer, and Artist (Team of 3)",
      "date": "",
      "details": [
        "Architected the app logic flow including game system and bridging Flutter and Unity frameworks, implemented eight out of twelve main screens in the current build, and solely created and integrated the 3D world scenes in Unity, including a scene management system with four main game scenes.",
        "Transitioned from a Unity-only prototype to a Flutter + Unity workflow, boosting performance and reducing battery usage by over five times (confirmed by a 20-player playtest).",
        "Implemented a modular JSON-based localization system supporting four languages, ensuring a scalable approach to item localization.",
        "Engineered a top-view vegetation system using fewer than 35 vertices per tree, achieving 30 FPS with more than 30,000 trees on an iPhone XR—triple the capacity of standard approaches.",
        "Produced over 50 vector art assets and a cohesive UI theme for eight in-game cities, plus 30+ custom 3D models for buildings, trees, and environments."
      ]
    },
    {
      "title": "Hello World",
      "subtitle": "A 'Togo list' mobile app powered by LLMs",
      "description": "Programmer, Designer, and Artist (Team of 3)",
      "date": "",
      "details": [
        "Engineered LLM prompts to generate daily Togo Quests and deployed a Node.js backend on Google Cloud Run, ensuring secure and scalable LLM request processing.",
        "Architected and collaboratively optimized Google Maps API usage in the Togo Quest system, cutting calls by nearly 100% through SQLite-based location caching and efficient distance checks.",
        "Led the UI and app-flow for five core features and eight screens, ensuring a seamless user experience."
      ]
    },
    {
      "title": "DrawAll",
      "subtitle": "A graffiti-wall inspired drawing-board social media",
      "description": "Solo Full-Stack Developer",
      "date": "",
      "details": [
        "Engineered a 256×256 tile-based, coordinate-query lazy-loading mechanism using Firestore and Google Cloud Storage, allowing partial image updates per stroke and cutting average board load times by up to 300%, while enabling infinite board length.",
        "Developed a ‘fence system’ to protect specific board coordinates by defining max fence lengths and section-based partitioning, limiting reads to at most 2 Firestore documents per interaction.",
        "Built a modular layering system and unified template for all on-board media and content, cutting roughly 5,000 lines of code and ensuring a more scalable, maintainable architecture.",
        "Designed an end-to-end data flow utilizing Firestore and Google Cloud Storage for posts, media cards, board configurations, and more.",
        "Implemented a full-featured workflow covering user accounts, lobby/board searches, collaborative drawing, and sharing."
      ]
    },
    {
      "title": "Kwjibo",
      "subtitle": "A desktop rogue-like game featuring unique joystick gestural combat",
      "description": "Technical Designer & Programmer (Team of 5)",
      "date": "",
      "details": [
        "Implemented a joystick gesture detection system supporting sequential inputs through an eight-direction checkpoint and state-machine structure.",
        "Built a timeline event framework replacing hardcoded logic, now serving as the foundation for in-game events and combat mechanics."
      ]
    },
    {
      "title": "Multiversal Lover",
      "subtitle": "One of the earliest ChatGpt powered dating chatbots",
      "description": "Lead Full-Stack Developer (Team of 3)",
      "date": "",
      "details": [
        "Employed prompt engineering to segment single LLM responses into multiple brief messages, simulating real-time chat.",
        "Implemented a browser-side inactivity timer triggering system requests, allowing the LLM to start new conversation prompts.",
        "Deployed AWS Lambda for LLM processing and AWS S3 for conversation storage, providing scalable, reliable performance."
      ]
    }
  ]
}