{
  "name": "JT Tao",
  "title": "Full Stack Developer",
  "contact": {
    "email": "ttyy550@gmail.com",
    "phone": "(408) 231-5832",
    "location": "San Jose, CA",
    "github": "github.com",
    "website": "google.com"
  },
  "skills": [
    {
      "category": "Programming & Frameworks",
      "items": [
        "JavaScript",
        "TypeScript",
        "Python",
        "Flutter",
        "React.js",
        "C, C++, C#",
        "Unity Engine"
      ]
    },
    {
      "category": "Backend & Databases",
      "items": [
        "Node.js, Express.js",
        "SQL (MySQL, PostgreSQL)",
        "NoSQL (MongoDB, Firestore)",
        "Vector Databases",
        "RESTful APIs & GraphQL"
      ]
    },
    {
      "category": "Cloud, DevOps & Tools",
      "items": [
        "Google Cloud (Cloud Run, App Engine, Storage)",
        "AWS (S3, Lambda)",
        "Firebase",
        "Docker",
        "CI/CD (GitHub Actions, Jenkins)",
        "Version Control (Git, Perforce)"
      ]
    }
  ],
  "summary": {
    "title": "Summary",
    "description": "Full Stack Developer with expertise in React, Flutter, and backend architecture on Google Cloud and AWS. Skilled in creating scalable web and mobile applications with a strong focus on UI/UX and optimal user engagement. Proficient in rapid prototyping, game development workflows, and prompt engineering for LLM-based solutions.",
    "sub-sections": []
  },
  "experience": {
    "title": "Experience",
    "description": "",
    "sub-sections": [
      {
        "title": "Let’s Be Critic",
        "subtitle": "A complaint and advisory chatbot",
        "description": "Solo Full-Stack Developer",
        "date": "",
        "details": [
          "Developed an LLM-driven search trigger to analyze user input and historical data prior to vector queries, reducing unnecessary searches by 70% with minimal overhead.",
          "Architected a Firestore-based tracking and scheduling system that automates keypoint storage in a vector store, enabling Cloud Run deployment and eliminating the need for a dedicated server.",
          "Created an asynchronous dual-LLM workflow, separating chat handling from keypoint summarization and storage, reducing token usage by up to 80% thanks to a shorter required context."
        ]
      },
      {
        "title": "Cardio Traveler",
        "subtitle": "A mobile fitness serious game",
        "description": "Lead Programmer, Designer, and Artist (Team of 3)",
        "date": "",
        "details": [
          "Transitioned from a Unity-only prototype to a Flutter + Unity workflow, boosting performance and reducing battery usage by over five times (confirmed by a 20-player playtest).",
          "Implemented a modular JSON-based localization system supporting four languages, ensuring a scalable approach to item localization.",
          "Engineered a top-view vegetation system using fewer than 35 vertices per tree, achieving 30 FPS with more than 30,000 trees on an iPhone XR—triple the capacity of standard approaches."
        ]
      },
      {
        "title": "DrawAll",
        "subtitle": "A graffiti-wall inspired drawing-board social media",
        "description": "Solo Full-Stack Developer",
        "date": "",
        "details": [
          "Engineered a 256×256 tile-based, coordinate-query lazy-loading mechanism using Firestore and Google Cloud Storage, allowing partial image updates per stroke and cutting average board load times by up to 300%, while enabling infinite board length.",
          "Developed a ‘fence system’ to protect specific board coordinates by defining max fence lengths and section-based partitioning, limiting reads to at most 2 Firestore documents per interaction.",
          "Built a modular layering system and unified template for all on-board media and content, cutting roughly 5,000 lines of code and ensuring a more scalable, maintainable architecture."
        ]
      },
      {
        "title": "Hero’s Clock",
        "subtitle": "A light-weight cross-platform productivity app",
        "description": "Solo Flutter Developer",
        "date": "",
        "details": [
          "Introduced a page-view UI and a 'cached last page' mechanic, cutting user interaction steps from three to one for single-task-timer features.",
          "Crafted a responsive UI and app-flow for both mobile and web, employing a screen utility system to maintain consistent layouts across various devices."
        ]
      },
      {
        "title": "Hello World",
        "subtitle": "A 'Togo list' mobile app powered by LLMs",
        "description": "Programmer, Designer, and Artist (Team of 3)",
        "date": "",
        "details": [
          "Engineered LLM prompts to generate daily Togo Quests and deployed a Node.js backend on Google Cloud Run, ensuring secure and scalable LLM request processing.",
          "Architected and collaboratively optimized Google Maps API usage in the Togo Quest system, cutting calls by nearly 100% through SQLite-based location caching and efficient distance checks."
        ]
      }
    ]
  },
  "education": {
    "title": "Education & Academic Experience",
    "description": "",
    "sub-sections": [
      {
        "title": "University of California, Santa Cruz",
        "description": "Computational Media MS in Game & Playable Media (Candidate)",
        "date": ""
      },
      {
        "title": "University of California, Santa Cruz",
        "description": "Bachelor of Science in Computer Science (Frontend Development Focus)",
        "date": ""
      },
      {
        "title": "Hackathon: Branch Manager",
        "description": "Won first place in a school-hosted cross-department contest (Fall 2023) by developing a sustainability-themed Unity idle-game within 48 hours",
        "date": ""
      },
      {
        "title": "Breeze Capstone Campaign",
        "description": "Led and managed a team of 3 to prototype Breeze for the MS in Game & Playable Media capstone project",
        "date": ""
      },
      {
        "title": "Playtest Night Participant",
        "description": "Showcased Drawall.world and Breeze at two public school-hosted events with 30+ industry testers each",
        "date": ""
      }
    ]
  }
}