{
  "name": "Weiyan Tao",
  "title": "Full Stack Developer",
  "contact": {
    "email": "ttyy550@gmail.com",
    "phone": "(408) 231-5832",
    "location": "San Jose, CA",
    "github": "github.com",
    "website": "google.com"
  },
  "skills": [
    {
      "category": "General Skills",
      "items": [
        "Full Stack Development",
        "Software & Mobile App Development",
        "UI & UX Design",
        "Game Development",
        "Cloud & Backend Engineering",
        "Scalable Framework Engineering",
        "Prompt Engineering & Fine-tuning",
        "Vector Store Integration",
        "Rapid Prototyping"
      ]
    },
    {
      "category": "Programming Languages",
      "items": [
        "Dart",
        "JavaScript",
        "TypeScript",
        "Python",
        "C#"
      ]
    },
    {
      "category": "Frameworks & Libraries",
      "items": [
        "React.js",
        "Flutter",
        "Unity Engine",
        "Node.js",
        "Express"
      ]
    },
    {
      "category": "Cloud & Tools",
      "items": [
        "Google Cloud (Firestore, Cloud Run)",
        "AWS (Lambda, S3)",
        "Docker",
        "Firebase",
        "Adobe Illustrator / Figma",
        "Git / Linux CLI"
      ]
    },
    {
      "category": "Art & Design",
      "items": [
        "Paper & Digital Drawing",
        "Adobe Illustrator",
        "Blender 3D Modeling",
        "Shader Development",
        "Figma"
      ]
    }
  ],
  "summary": {
    "title": "Summary",
    "description": "Full Stack Developer with expertise in React, Flutter, and backend architecture on Google Cloud and AWS. Skilled in creating scalable web and mobile applications with a strong focus on UI/UX and optimal user engagement. Proficient in rapid prototyping, game development workflows, and prompt engineering for LLM-based solutions.",
    "sub-sections": []
  },
  "experience": {
    "title": "Experience",
    "description": "",
    "sub-sections": [
      {
        "title": "Let’s Be Critic",
        "subtitle": "A complaint and advisory chatbot",
        "description": "Solo Full-Stack Developer",
        "date": "",
        "details": [
          "Implemented an LLM-powered search trigger that analyzes user input and past results prior to vector queries, cutting unnecessary searches by 70% with no performance loss",
          "Designed a Firestore-based tracking and scheduler system that automates conversation-keypoints storage to the vector store, enabling Cloud Run for the chatbot, which previously required a server to handle chat sessions",
          "Developed an asynchronous dual-LLM workflow for the 'complaint' chat system. One channel handles the chat, one channel handles the keypoints summarization and storage. This approach reduced token usage up to 80% because of shorter context to LLM required",
          "Refined prompt engineering and response handling to enable seamless topic-product switching in a single chat session, improving UX"
        ]
      },
      {
        "title": "Cardio Traveler",
        "subtitle": "A mobile fitness serious game",
        "description": "Lead Programmer, Designer, and Artist (Team of 3)",
        "date": "",
        "details": [
          "Designed and implemented 8 out of 12 Flutter app screens. Solely developed and integrated the entire 3D world scenes in Unity, including a scene management system with 4 main game scenes (2 currently in demo).",
          "Migrated the initial Unity-only prototype to a Flutter + Unity workflow, improving performance and cutting battery usage by over 5 times (based on a playtest over 20 players)",
          "Developed a scalable localization system with Modular JSON Loading, supporting 4 languages, and ensured a scalable item localization structure.",
          "Engineered a top-view vegetation system using <35 vertices per tree, enabling 30 FPS rendering of over 30k trees on iPhone XR—3x more than traditional methods"
        ]
      },
      {
        "title": "DrawAll",
        "subtitle": "A graffiti-wall inspired drawing-board social media",
        "description": "Solo Developer",
        "date": "",
        "details": [
          "Developed a grid-based, coordinate-query lazy-load mechanic leveraging Firestore and Google Cloud Storage that reduced average board loading time by 3 times and enabled infinite-length drawing boards",
          "Developed a layering system and a uniformed template for all 'on-board' media and content objects and placement. Successfully cutting ~5,000 lines of code and ensured a scalable and maintainable system compared to the initial implementation",
          "Implemented a complete workflow—from user accounts and lobby/board search to collaborative drawing and sharing experience"
        ]
      },
      {
        "title": "Hero’s Clock",
        "subtitle": "A light-weight cross-platform productivity app",
        "description": "Solo Flutter Developer",
        "date": "",
        "details": [
          "Designed and implemented this app's workflow and visual, created 7 image assets, and developed 2 different save methods for tasks: shared_preference for caching current tasks, and SQLite for saving favorite tasks. Ran 2 user tests which resulted in one major UI revision that split features into 3 screens",
          "Designed UI and app-flow with consideration for both mobile and web environments, and developed a screen utility system to ensure the UI looks consistent and natural on different screen sizes",
          "Implemented a page-view UI for features and a 'cached last page' mechanic, reducing UI interaction steps from 3 to 1 for single-task-timer features"
        ]
      },
      {
        "title": "Hello World",
        "description": "Programmer, Designer, and Artist (Team of 3)",
        "date": "",
        "details": [
          "Co-developed a 'togo quest' system cutting Google Maps API usage by 500% via SQL caching and distance checks",
          "Implemented a Node.js backend on Google Cloud Run to efficiently handle LLM requests"
        ]
      }
    ]
  },
  "education": {
    "title": "Education & Academic Experience",
    "description": "",
    "sub-sections": [
      {
        "title": "University of California, Santa Cruz",
        "description": "Computational Media MS in Game & Playable Media (Candidate)",
        "date": ""
      },
      {
        "title": "University of California, Santa Cruz",
        "description": "Bachelor of Science in Computer Science (Frontend Development Focus)",
        "date": ""
      },
      {
        "title": "Hackathon: Branch Manager",
        "description": "Won first place in a school-hosted cross-department contest (Fall 2023) by developing a sustainability-themed Unity idle-game within 48 hours",
        "date": ""
      },
      {
        "title": "Breeze Capstone Campaign",
        "description": "Led and managed a team of 3 to prototype Breeze for the MS in Game & Playable Media capstone project",
        "date": ""
      },
      {
        "title": "Playtest Night Participant",
        "description": "Showcased Drawall.world and Breeze at two public school-hosted events with 30+ industry testers each",
        "date": ""
      }
    ]
  }
}